[
    {
        "name": "NASA: The PolCube CubeSat polarimeter",
        "description": "A student will learn to run and apply the PolCube-MAPP algorithm to study sensitivity to spherical and non-spheroidal aerosols from the future PolCube satellite instrument. Polarimetry is a passive, remote-sensing technique that provides unparalleled capabilities for characterizing atmospheric aerosols. Aerosol particles in the atmosphere are highly variable and depend greatly upon their source (e.g., sea salt, yellow sand, Asian dust, and soot from power plants, diesel exhaust, fires, waste incineration, etc.). Knowledge of the fundamental properties of aerosols and their interactions with the atmosphere, hydrosphere, and biosphere are relevant to NASA and other Agencies (e.g., Army operations, infrastructure, and stewardship). In addition, poor air quality impacts the health and well-being of the public.",
        "location": null,
        "mode": [
            "virtual"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000AKTj2AO",
        "opens_applications": "open",
        "grade_level": [
            11,
            12
        ],
        "price": 0,
        "active": true
    },
    {
        "name": "NASA: ESEA - Equity Strategies for Emerging Aviation",
        "description": "Recent advances in electric propulsion and automation have enabled emerging aviation concepts that have the potential to radically change the way people and cargo move from place to place. Current startup companies in the United States are proposing:\r\n\r\n* passenger-carrying air vehicles that can move people between different urban areas 2-10 times faster than today’s transportation, at lower environmental cost and with less noise \r\n\r\n* automated cargo vehicles that take advantage of today’s underutilized small airports to ship goods regionally\r\n\r\n* emergency response operations that allow faster response times with less risk to emergency responders\r\n\r\nTraditionally, new modes of transportation in the United States have benefited upper social classes at the expense of underrepresented and lower socioeconomic classes. Several recent studies in transportation have explored this disparity, and research has highlighted factors that contribute to transportation equity. In this effort, we will examine this previous work as it applies to the broader, current transportation system. First, we will use our literature search to highlight and educate the current emerging aviation stakeholders on equity strategies that are directly applicable to these novel operations. Second, we will use our literature research to make informed recommendations for experiments and data collection that will increase our understanding about how these new aviation concepts can be encouraged to provide equity as an emergent property.",
        "location": "California",
        "mode": [
            "in-person",
            "virtual"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000Bmnh2AC",
        "opens_applications": "open",
        "grade_level": [
            11,
            12
        ],
        "price": 0,
        "active": true
    }
]