[
    {
        "name": "NASA: The PolCube CubeSat polarimeter",
        "description": "A student will learn to run and apply the PolCube-MAPP algorithm to study sensitivity to spherical and non-spheroidal aerosols from the future PolCube satellite instrument. Polarimetry is a passive, remote-sensing technique that provides unparalleled capabilities for characterizing atmospheric aerosols. Aerosol particles in the atmosphere are highly variable and depend greatly upon their source (e.g., sea salt, yellow sand, Asian dust, and soot from power plants, diesel exhaust, fires, waste incineration, etc.). Knowledge of the fundamental properties of aerosols and their interactions with the atmosphere, hydrosphere, and biosphere are relevant to NASA and other Agencies (e.g., Army operations, infrastructure, and stewardship). In addition, poor air quality impacts the health and well-being of the public.",
        "location": null,
        "mode": [
            "virtual"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000AKTj2AO",
        "opens_applications": "open",
        "grade_level": [
            11,
            12
        ],
        "price": 0
    },
    {
        "name": "NASA: ESEA - Equity Strategies for Emerging Aviation",
        "description": "Recent advances in electric propulsion and automation have enabled emerging aviation concepts that have the potential to radically change the way people and cargo move from place to place. Current startup companies in the United States are proposing:\r\n\r\n* passenger-carrying air vehicles that can move people between different urban areas 2-10 times faster than today’s transportation, at lower environmental cost and with less noise \r\n\r\n* automated cargo vehicles that take advantage of today’s underutilized small airports to ship goods regionally\r\n\r\n* emergency response operations that allow faster response times with less risk to emergency responders\r\n\r\nTraditionally, new modes of transportation in the United States have benefited upper social classes at the expense of underrepresented and lower socioeconomic classes. Several recent studies in transportation have explored this disparity, and research has highlighted factors that contribute to transportation equity. In this effort, we will examine this previous work as it applies to the broader, current transportation system. First, we will use our literature search to highlight and educate the current emerging aviation stakeholders on equity strategies that are directly applicable to these novel operations. Second, we will use our literature research to make informed recommendations for experiments and data collection that will increase our understanding about how these new aviation concepts can be encouraged to provide equity as an emergent property.",
        "location": "California",
        "mode": [
            "in-person",
            "virtual"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000Bmnh2AC",
        "opens_applications": "open",
        "grade_level": [
            11,
            12
        ],
        "price": 0
    },
    {
        "name": "NASA: Materials Processing for Space Nuclear Propulsion",
        "description": "This hands-on opportunity involves processing, characterizing, and testing  novel materials for NASA Space Nuclear Propulsion applications. Experience with nuclear materials in not a requirement. \r\nThe EM32 Advanced Processes team is looking for a few candidates to fabricate fuel and surrogate fuel materials into elements. The elements will then be characterized and tested in our onsite laboratories. Safety is our number one priority. All necessary training will be provided. The opportunity may involve a variety of materials processing techniques including powder processing and sintering. The opportunity will expose the candidate to materials characterization and testing techniques such as SEM, XRD, hardness mapping, tensile testing, and metallurgical preparation, polishing, and analysis. The description above is general, as the actual work performed will vary from day-to-day in a dynamic team environment. \r\n\r\nThe applicant should possess a general understanding of materials engineering and be able to implement fundamental engineering concepts in real world applications. The applicant should be adept at hands-on, laboratory and/or mechanical tasks and have a passion for getting dirty from hard work! Nuclear materials processing is a plus. \r\n\r\nCandidate must be an excellent communicator with strong speaking, writing, and presenting skills. Candidate must be a self-starter who takes initiative to complete tasks on time with reasonable supervision. Candidate will demonstrate the ability to work independently as well as in small, multi-disciplined teams. \r\n\r\nThe applicant should be proficient in the MS Office suite including. Excel, PowerPoint, and Word. Applicant should be familiar with basic CAD software like Solid Edge, Solid Works or Pro Engineer.\r\n\r\nKey words:\r\nMaterials Science, Engineering, Nuclear, laboratory, hands-on, powders, ceramics, carbides, fuel, Excel, Power Point, Word, Mechanical design, machining, welding, communicator, speaking, writing, presenting, initiative, humility, team, multi-disciplined, CAD.",
        "location": "Alabama",
        "mode": [
            "in-person"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000J32D2AS",
        "opens_applications": "open",
        "grade_level": [
            11,
            12
        ],
        "price": 0
    },
    {
        "name": "NASA: Pneumatic Shock System – Methods and Development",
        "description": "Assist the development and documentation of the capability and setups needed to meet the various lunar/mars mission shock levels quickly, efficiently and safely with the Pneumatic Shock Simulator (PSS). Also, to conduct additional near field shock testing for application in instances the levels are past the PSS’s capabilities.\r\n\r\n[NOTE: If you are selected for participation in an internship, you will be required to visit a NASA center or facility for fingerprinting and identity verification. Accommodations can be requested for selected candidates with disabilities. NASA Centers and Facilities - https://science.nasa.gov/about-us/nasa-centers]",
        "location": null,
        "mode": [
            "virtual"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000VUD72AO",
        "opens_applications": "open",
        "grade_level": [
            9,
            10,
            11,
            12
        ],
        "price": 0
    },
    {
        "name": "NASA: Ground Safety Intern",
        "description": "Shadow and perform hazard analysis of systems at WFF with experienced ground safety analysts and engineers, and review several simple hazard systems for final evaluation and approval.  After gaining understanding of how hazards are reviewed and planned for, consider how this process can be partially supplemented with Artificial Intelligence (AI).  Candidate should be familiar with AI tools, languages, and be able to conduct sample evaluations on a close internal network.  Enrolled in an AI program is preferred but not required.  \r\nWork environment is in office and in the field such as rocket integration facility and launch pads.  Walking up and down between piping runs are expected.",
        "location": "Virginia",
        "mode": [
            "in-person"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000lVDF2A2",
        "opens_applications": "open",
        "grade_level": [
            12
        ],
        "price": 0
    },
    {
        "name": "NASA: Lidar Design & Development",
        "description": "Are you a forward-thinking and ambitious individual ready to embark on a groundbreaking journey in the realm of Mechanical Engineering? We are thrilled to offer an extraordinary opportunity to join our team and be at the forefront of innovation. As part of this exciting venture, you will be instrumental in crafting Lidar Systems using state-of-the-art Additive Manufacturing techniques and cutting-edge lattice networks. This unique position invites you to push the boundaries of what's possible in the world of mechanical engineering, contributing to the development of revolutionary technologies that will shape the future. If you are passionate about pushing the limits of engineering and eager to make a significant impact, we invite you to be a key player in redefining the landscape of Lidar Systems. Seize the chance to unleash your creativity and expertise on projects that will redefine the industry!\r\n\r\nWe are seeking a highly motivated and enthusiastic student to join our dynamic team as a Mechanical Engineering Intern. This internship opportunity will provide hands-on experience in cutting-edge projects related to Lidar Systems, Additive Manufacturing, and Lattice Metal Systems. As a key member of our engineering team, you will contribute to the development and advancement of innovative technologies in the field of mechanical engineering.\r\n\r\nResponsibilities:\r\nLidar Systems Development:\r\n•\tCollaborate with cross-functional teams to design and optimize mechanical components for Lidar systems.\r\n•\tConduct research on Lidar technologies and contribute to the development of next-generation systems.\r\n•\tPerform testing and analysis to ensure the performance and reliability of Lidar components.\r\n\r\nAdditive Manufacturing:\r\n•\tWork on projects involving additive manufacturing techniques, including 3D printing, to produce complex and optimized mechanical structures.\r\n•\tParticipate in the selection of materials and processes for additive manufacturing applications.\r\n•\tAssist in the design and prototyping of components using additive manufacturing methods.\r\n\r\nLattice Metal Systems:\r\n•\tContribute to the design and optimization of lattice metal structures for various engineering applications.\r\n•\tCollaborate with the engineering team to conduct simulations and analysis of lattice structures.\r\n•\tWork on projects aimed at exploring the mechanical properties and applications of lattice metal systems.\r\n\r\nQualifications:\r\n•\tCurrently enrolled in a bachelor’s program in Mechanical Engineering or a related field.\r\n•\tHigh school students may apply. \r\n•\tStrong understanding of mechanical engineering principles and fundamentals.\r\n•\tProficiency in CAD software (e.g., SolidWorks, AutoCAD) for 3D modeling and design.\r\n•\tKnowledge or coursework related to Lidar Systems, Additive Manufacturing, and Lattice Metal Systems is a plus.\r\n•\tStrong problem-solving skills and attention to detail.\r\n•\tEffective communication and teamwork abilities.\r\n\r\nBenefits:\r\n•\tGain hands-on experience in cutting-edge mechanical engineering projects.\r\n•\tWork closely with experienced engineers and mentors.\r\n•\tExposure to real-world applications of Lidar Systems, Additive Manufacturing, and Lattice Metal Systems.\r\n•\tOpportunity to contribute to innovative solutions and make a meaningful impact.",
        "location": "Maryland",
        "mode": [
            "in-person"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000oL9J2AU",
        "opens_applications": "open",
        "grade_level": [
            12
        ],
        "price": 0
    },
    {
        "name": "NASA: AI & ML for Air Traffic Management",
        "description": "This project explores the use of innovative and emerging applications of AI/ML (e.g., Natural Language Processing) to digitize and analyze heritage air traffic management (ATM) datasets. Given the rich volume of available text, audio and track data and the complexity of the problem space, this is an ideal candidate for the application of machine learning. The research is focused on optimizing current day flight operations e.g., to perform runway configuration management and analyze Traffic Management Initiatives (TMIs). The work will help build semi-automated recommender services that can assist complex decision making currently made by FAA specialists and subject matter experts. This internship can be onsite or remote.",
        "location": "California",
        "mode": [
            "in-person",
            "virtual"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000v3vd2AA",
        "opens_applications": "open",
        "grade_level": [
            11,
            12
        ],
        "price": 0
    },
    {
        "name": "NASA: Knowledge Management",
        "description": "NASA's Office of the Chief Engineer is charged with managing knowledge learned from NASA projects. This includes the documentation of lessons, best practices, and other positive and negative experiences. It includes the use of the previous knowledge gained in ways that promote improved future project execution.  The capture of knowlege from departing members of the workforce and the infusion of knowledge to incoming workers is also within scope.  \r\n\r\nThe Langley Office of the Chief Engineer has an opportunity for you to gain on-the-job experience as you work with Langley and other NASA engineers, scientists, project managers, budget/schedule experts, etc., to help us better encapsulate past knowledge learned and incorporate it into future endeavors.  Among other activities, we are expecting Summer 2025 student interns to use story-telling techniques to help motivate Langley workforce to more broadly share and infuse knowledge with each other. \r\n\r\nThe ideal candidate would be able to communicate well in a variety of media, be a good team player, have tenacity to get details right, and be able to innovate in a constrained environment (e.g., a 10-week internship).",
        "location": null,
        "mode": [
            "virtual"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000xpcn2AA",
        "opens_applications": "open",
        "grade_level": [
            11,
            12
        ],
        "price": 0
    }
]