[
    {
        "name": "NASA: The PolCube CubeSat polarimeter",
        "description": "A student will learn to run and apply the PolCube-MAPP algorithm to study sensitivity to spherical and non-spheroidal aerosols from the future PolCube satellite instrument. Polarimetry is a passive, remote-sensing technique that provides unparalleled capabilities for characterizing atmospheric aerosols. Aerosol particles in the atmosphere are highly variable and depend greatly upon their source (e.g., sea salt, yellow sand, Asian dust, and soot from power plants, diesel exhaust, fires, waste incineration, etc.). Knowledge of the fundamental properties of aerosols and their interactions with the atmosphere, hydrosphere, and biosphere are relevant to NASA and other Agencies (e.g., Army operations, infrastructure, and stewardship). In addition, poor air quality impacts the health and well-being of the public.",
        "location": null,
        "mode": [
            "virtual"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000AKTj2AO",
        "opens_applications": "open",
        "grade_level": [
            11,
            12
        ],
        "price": 0
    },
    {
        "name": "NASA: ESEA - Equity Strategies for Emerging Aviation",
        "description": "Recent advances in electric propulsion and automation have enabled emerging aviation concepts that have the potential to radically change the way people and cargo move from place to place. Current startup companies in the United States are proposing:\r\n\r\n* passenger-carrying air vehicles that can move people between different urban areas 2-10 times faster than today’s transportation, at lower environmental cost and with less noise \r\n\r\n* automated cargo vehicles that take advantage of today’s underutilized small airports to ship goods regionally\r\n\r\n* emergency response operations that allow faster response times with less risk to emergency responders\r\n\r\nTraditionally, new modes of transportation in the United States have benefited upper social classes at the expense of underrepresented and lower socioeconomic classes. Several recent studies in transportation have explored this disparity, and research has highlighted factors that contribute to transportation equity. In this effort, we will examine this previous work as it applies to the broader, current transportation system. First, we will use our literature search to highlight and educate the current emerging aviation stakeholders on equity strategies that are directly applicable to these novel operations. Second, we will use our literature research to make informed recommendations for experiments and data collection that will increase our understanding about how these new aviation concepts can be encouraged to provide equity as an emergent property.",
        "location": "California",
        "mode": [
            "in-person",
            "virtual"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000Bmnh2AC",
        "opens_applications": "open",
        "grade_level": [
            11,
            12
        ],
        "price": 0
    },
    {
        "name": "NASA: Materials Processing for Space Nuclear Propulsion",
        "description": "This hands-on opportunity involves processing, characterizing, and testing  novel materials for NASA Space Nuclear Propulsion applications. Experience with nuclear materials in not a requirement. \r\nThe EM32 Advanced Processes team is looking for a few candidates to fabricate fuel and surrogate fuel materials into elements. The elements will then be characterized and tested in our onsite laboratories. Safety is our number one priority. All necessary training will be provided. The opportunity may involve a variety of materials processing techniques including powder processing and sintering. The opportunity will expose the candidate to materials characterization and testing techniques such as SEM, XRD, hardness mapping, tensile testing, and metallurgical preparation, polishing, and analysis. The description above is general, as the actual work performed will vary from day-to-day in a dynamic team environment. \r\n\r\nThe applicant should possess a general understanding of materials engineering and be able to implement fundamental engineering concepts in real world applications. The applicant should be adept at hands-on, laboratory and/or mechanical tasks and have a passion for getting dirty from hard work! Nuclear materials processing is a plus. \r\n\r\nCandidate must be an excellent communicator with strong speaking, writing, and presenting skills. Candidate must be a self-starter who takes initiative to complete tasks on time with reasonable supervision. Candidate will demonstrate the ability to work independently as well as in small, multi-disciplined teams. \r\n\r\nThe applicant should be proficient in the MS Office suite including. Excel, PowerPoint, and Word. Applicant should be familiar with basic CAD software like Solid Edge, Solid Works or Pro Engineer.\r\n\r\nKey words:\r\nMaterials Science, Engineering, Nuclear, laboratory, hands-on, powders, ceramics, carbides, fuel, Excel, Power Point, Word, Mechanical design, machining, welding, communicator, speaking, writing, presenting, initiative, humility, team, multi-disciplined, CAD.",
        "location": "Alabama",
        "mode": [
            "in-person"
        ],
        "season": "summer",
        "deadline": {
            "year": 2025,
            "month": 2,
            "day": 28
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000000J32D2AS",
        "opens_applications": "open",
        "grade_level": [
            11,
            12
        ],
        "price": 0
    }
]