[
    {
        "name": "NASA: Prototype Fluid System",
        "description": "Autonomous Systems Lab; AA04\tPrototype Fluid System\tCreating prototype fluid system with sensor and actuator interfaces to data acquisition & control system and G2/NPAS Digital Twin. Rationale: (1) Creates laboratory hardware system useful for demos; (2) Implementing a model system supports G2/NPAS training by providing actual hardware elements; (3) Building a simple fluid system lays groundwork for developing a more advanced ACM fluid system. \tPrototyping & Fabrication; Testing/Data Acquisition",
        "location": "Mississippi",
        "mode": [
            "in-person"
        ],
        "season": "fall",
        "deadline": {
            "year": 2025,
            "month": 5,
            "day": 16
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000002XvSz2AK",
        "opens_applications": "open",
        "grade_level": [
            12
        ],
        "price": 0
    },
    {
        "name": "NASA: High Temperature Materials and Structures",
        "description": "Students will assist with the development of high-temperature (T > 2000°F) materials and structures for hypersonic vehicles. The primary material systems of interest are carbon/carbon (C/C) and ceramic matrix composites (CMC). This is a multi-disciplinary effort involving heat transfer, aerodynamic heating, thermal and mechanical testing, environmental testing, coatings, and materials and structures, all focused toward the development of thermal protection systems and hot structures for hypersonic vehicles. The work may involve high-temperature testing in several different facilities, and possibly some numerical analysis. Especially interested in graduate students who want to come for several sessions during their graduate program (may initiate during undergraduate) to research topics in C/C and CMCs such as isotropy, fracture toughness, bearing strength, high temperature test methods, failure modes, active oxidation, etc.",
        "location": "Virginia",
        "mode": [
            "in-person"
        ],
        "season": "fall",
        "deadline": {
            "year": 2025,
            "month": 5,
            "day": 16
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000002czSj2AI",
        "opens_applications": "open",
        "grade_level": [
            12
        ],
        "price": 0
    },
    {
        "name": "NASA: AI & ML for Air Traffic Management",
        "description": "This project explores the use of innovative and emerging applications of AI/ML (e.g., Natural Language Processing) to digitize and analyze heritage air traffic management (ATM) datasets. Given the rich volume of available text, audio and track data and the complexity of the problem space, this is an ideal candidate for the application of machine learning. The research is focused on optimizing current day flight operations e.g., to perform runway configuration management and analyze Traffic Management Initiatives (TMIs). The work will help build semi-automated recommender services that can assist complex decision making currently made by FAA specialists and subject matter experts.",
        "location": "California",
        "mode": [
            "in-person"
        ],
        "season": "fall",
        "deadline": {
            "year": 2025,
            "month": 5,
            "day": 16
        },
        "link": "https://stemgateway.nasa.gov/s/course-offering/a0BSJ000002YSDd2AO",
        "opens_applications": "open",
        "grade_level": [
            11,
            12
        ],
        "price": 0
    }
]